Tekla Open API Reference for Tekla Structures 2025
Operation.ShapeMetadataResult Enumeration
 The result type of the shape metadata operations. If you alter this, check if you need to change ShapeMetadataResult_e on the Tekla Structures core side
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ShapeMetadataResult
Public Enumeration ShapeMetadataResult
Members
Member name | Value | Description
NoResult | 0 |  Operation failed.
OK | 1 |  Operation succeeded.
DuplicateKeyExist | 2 |  At least one identical pre-existing key was found in the shape when trying to insert key and value
NoMatchingShape | 3 |  No matching shape found for the GUID in the catalog
NoMatchingKey | 4 |  No matching key found for the GUID in the shape
See Also
Reference
Tekla.Structures.Model.Operations Namespace